espressif/esp-protocols/components/esp_websocket_client/example-linux/sdkconfig.defaults
CONFIG_IDF_TARGET="linux"
CONFIG_IDF_TARGET_LINUX=y

